reddit/app/controllers/posts_controller.rb

  def new
    @post = Post.new
    @subjects = Sub.all
---
SELECT "subs".* FROM "subs"

  def create
    @post = Post.new(post_params)
    @post.author_id = current_user.id

    # @post.sub_id = params[:sub_id]
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "sub_id", "author_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"  [["title", "/New Post"], ["url", "www"], ["content", "haha"], ["sub_id", 3], ["author_id", 3], ["created_at", "2018-05-15 22:04:40.638357"], ["updated_at", "2018-05-15 22:04:40.638357"]]

  def edit
      @subjects = Sub.all
      @post = Post.find(params[:id])
---
SELECT "subs".* FROM "subs"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]

  def index
    @subjects = Sub.all
    @post = Post.all
---
SELECT "posts".* FROM "posts"