reddit/app/controllers/subs_controller.rb

UPDATE "subs" SET "title" = $1, "description" = $2, "updated_at" = $3 WHERE "subs"."id" = $4  [["title", "good title"], ["description", "I am awesome!!!!"], ["updated_at", "2018-05-15 21:24:39.181517"], ["id", 1]]
---
  def update
    @sub = current_user.subs.find(params[:id])
    if @sub.update(sub_params)

SELECT "subs".* FROM "subs"
---
  def index
    @sub = Sub.all