reddit/app/views/posts/edit.html.erb

SELECT "subs"."id" FROM "subs" INNER JOIN "post_subs" ON "subs"."id" = "post_subs"."sub_id" WHERE "post_subs"."post_id" = $1  [["post_id", 3]]
---
<% @subjects.each do |sub| %>
  <input type="checkbox" name="post[sub_ids][]" value="<%=sub.id%>" <%= "checked" if @post.sub_ids.include?(sub.id) %> >